# IdeaStatiCa.RcsApi.Model.ConcreteCheckResultBase

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**InternalForces** | **ResultOfInternalForces** |  | [optional]
**NonConformities** | **List&lt;NonConformity&gt;** |  | [optional]
**Result** | **CheckResult** |  | [optional]
**CheckValue** | **double** |  | [optional]
**LimitCheckValue** | **double** |  | [optional]
**Check** | **CalculationType** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)